In [2]:
import numpy as np
import pandas as pd

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 1.45667441, -0.59571032,  0.95294835],
       [ 0.9933796 ,  0.62355085, -2.11331022],
       [-0.97278794, -0.93354355, -0.09110236],
       [-0.09163301,  0.2826662 , -0.29962824]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  1.456674 -0.595710  0.952948
1  0.993380  0.623551 -2.113310
2 -0.972788 -0.933544 -0.091102
3 -0.091633  0.282666 -0.299628

In [7]:
type(dataFrame)

pandas.core.frame.DataFrame

In [8]:
type(dataFrame[0])

pandas.core.series.Series

In [9]:
dataFrame[0]

0    1.456674
1    0.993380
2   -0.972788
3   -0.091633
Name: 0, dtype: float64

In [10]:
yeniDataFrame = pd.DataFrame(data, index = ["Atil", "Yusuf", "Ali", "Ahmet"], columns = ["Maas", "Yas","Calisma Saati"])

In [11]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atil   1.456674 -0.595710       0.952948
Yusuf  0.993380  0.623551      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633  0.282666      -0.299628

In [12]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atil   1.456674 -0.595710       0.952948
Yusuf  0.993380  0.623551      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633  0.282666      -0.299628

In [13]:
yeniDataFrame["Yas"]

Atil    -0.595710
Yusuf    0.623551
Ali     -0.933544
Ahmet    0.282666
Name: Yas, dtype: float64

In [14]:
yeniDataFrame[["Yas","Maas"]]

            Yas      Maas
Atil  -0.595710  1.456674
Yusuf  0.623551  0.993380
Ali   -0.933544 -0.972788
Ahmet  0.282666 -0.091633

In [15]:
yeniDataFrame.loc["Yusuf"]

Maas             0.993380
Yas              0.623551
Calisma Saati   -2.113310
Name: Yusuf, dtype: float64

In [16]:
yeniDataFrame.iloc[1]

Maas             0.993380
Yas              0.623551
Calisma Saati   -2.113310
Name: Yusuf, dtype: float64

In [17]:
yeniDataFrame.iloc[2]

Maas            -0.972788
Yas             -0.933544
Calisma Saati   -0.091102
Name: Ali, dtype: float64

In [18]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [19]:
yeniDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   1.456674 -0.595710       0.952948       -1.191421
Yusuf  0.993380  0.623551      -2.113310        1.247102
Ali   -0.972788 -0.933544      -0.091102       -1.867087
Ahmet -0.091633  0.282666      -0.299628        0.565332

In [20]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1)
#axis değeri belirtilmezse satırda arama yapılır ve hata çıkar. axis=0 satır
                                                                #axis=1 sütun

           Maas       Yas  Calisma Saati
Atil   1.456674 -0.595710       0.952948
Yusuf  0.993380  0.623551      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633  0.282666      -0.299628

In [21]:
yeniDataFrame.drop("Ahmet")

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   1.456674 -0.595710       0.952948       -1.191421
Yusuf  0.993380  0.623551      -2.113310        1.247102
Ali   -0.972788 -0.933544      -0.091102       -1.867087

In [22]:
yeniDataFrame
#drop metodu ile yapılan işlemler kalıcı olmadı. Kalıcı olması için bir değişkene eşitlenmeli ya da inplace kullanılmalı

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   1.456674 -0.595710       0.952948       -1.191421
Yusuf  0.993380  0.623551      -2.113310        1.247102
Ali   -0.972788 -0.933544      -0.091102       -1.867087
Ahmet -0.091633  0.282666      -0.299628        0.565332

In [23]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1, inplace=True)

In [24]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atil   1.456674 -0.595710       0.952948
Yusuf  0.993380  0.623551      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633  0.282666      -0.299628

In [25]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

0.9529483469796503

In [26]:
yeniDataFrame.loc["Yusuf","Yas"]
#Her iki kullanım da doğrudur

0.623550848731141

In [27]:
yeniDataFrame < 0

        Maas    Yas  Calisma Saati
Atil   False   True          False
Yusuf  False  False           True
Ali     True   True           True
Ahmet   True  False           True

In [28]:
yeniDataFrame[yeniDataFrame < 0]

           Maas       Yas  Calisma Saati
Atil        NaN -0.595710            NaN
Yusuf       NaN       NaN      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633       NaN      -0.299628

In [29]:
yeniDataFrame["Yas"] > 0

Atil     False
Yusuf     True
Ali      False
Ahmet     True
Name: Yas, dtype: bool

In [30]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

          Maas      Yas  Calisma Saati
Atil  1.456674 -0.59571       0.952948

In [31]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atil   1.456674 -0.595710       0.952948
Yusuf  0.993380  0.623551      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633  0.282666      -0.299628

In [32]:
yeniDataFrame.reset_index()

   index      Maas       Yas  Calisma Saati
0   Atil  1.456674 -0.595710       0.952948
1  Yusuf  0.993380  0.623551      -2.113310
2    Ali -0.972788 -0.933544      -0.091102
3  Ahmet -0.091633  0.282666      -0.299628

In [33]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atil   1.456674 -0.595710       0.952948
Yusuf  0.993380  0.623551      -2.113310
Ali   -0.972788 -0.933544      -0.091102
Ahmet -0.091633  0.282666      -0.299628

In [36]:
yeniIndeksListesi = ["Ati", "Yus", "Ali", "Ahm"]

In [37]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [38]:
yeniDataFrame

           Maas       Yas  Calisma Saati Yeni Indeks
Atil   1.456674 -0.595710       0.952948         Ati
Yusuf  0.993380  0.623551      -2.113310         Yus
Ali   -0.972788 -0.933544      -0.091102         Ali
Ahmet -0.091633  0.282666      -0.299628         Ahm

In [39]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          1.456674 -0.595710       0.952948
Yus          0.993380  0.623551      -2.113310
Ali         -0.972788 -0.933544      -0.091102
Ahm         -0.091633  0.282666      -0.299628

In [41]:
yeniDataFrame
#inplace kullanılmadığı için değişiklik kalıcı olmadı

           Maas       Yas  Calisma Saati Yeni Indeks
Atil   1.456674 -0.595710       0.952948         Ati
Yusuf  0.993380  0.623551      -2.113310         Yus
Ali   -0.972788 -0.933544      -0.091102         Ali
Ahmet -0.091633  0.282666      -0.299628         Ahm

In [43]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [44]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          1.456674 -0.595710       0.952948
Yus          0.993380  0.623551      -2.113310
Ali         -0.972788 -0.933544      -0.091102
Ahm         -0.091633  0.282666      -0.299628

In [46]:
yeniDataFrame.loc["Yus"]

Maas             0.993380
Yas              0.623551
Calisma Saati   -2.113310
Name: Yus, dtype: float64

# multi indeks

In [47]:
ilkIndeksler = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [48]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [49]:
birlesmisIndeks = list(zip(ilkIndeksler, icIndeksler))

In [50]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [51]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [52]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [53]:
benimCizgiFilmListem = [[40,"A"], [10,"B"], [30,"C"], [25,"D"] ,[45,"E"], [20,"F"]]

In [54]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [55]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index=birlesmisIndeks, columns=["Yas", "Meslek"])

In [56]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman  25      D
           Kenny    45      E
           Kyle     20      F

In [58]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [60]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       45
Meslek     E
Name: Kenny, dtype: object

In [61]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman  25      D
           Kenny    45      E
           Kyle     20      F

In [62]:
cizgiFilmDataFrame.index.names = ["Film Adı", "İsim"]

In [63]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman  25      D
           Kenny    45      E
           Kyle     20      F